# DirectShapeOptions Properties

---
The DirectShapeOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ReferencingOption|  Whether or not the geometry stored in a DirectShape object may be referenced.
| RoomBoundingOption|  Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations.
Top
#### Reference
DirectShapeOptions Class
Autodesk.Revit.DB Namespace